#pragma once
//防止头文件重复包含
#include <iostream>//包含输入输出头吻技安
using namespace std;//使用标准命名空间

#include "boss.h"
#include "employee.h"
#include "manager.h"


//文件有关
#include <fstream>
#define FILENAME "zhigong.txt"

class WorkerManager {

public:
	//构造函数的声明
	WorkerManager();
	
	//析构函数的声明
	~WorkerManager();
	//菜单函数的声明
	void showMenu();

	//把读取的信息写入文件
	void save();

	//统计一下文件中人数！
	int getEmpNum();

	//初始化数组
	void init_emp();



	//0退出----------------------------------------------------------------------
	void exitSystem();

	//1添加职工
	//什么样的数组存储
	//数组是存储相同数据类型的数据结构
//	不同的职工是不同的对象，那就把所有职工的指针存储在数组里
	//所以用一个存储Worker*类型的数组Worker*[size]，那用什么来操作这个数组呢？Worker**的指针

	//1添加职工----------------------------------------------------------------------
	void add_stuff();


	//2显示职工----------------------------------------------------------------------
	void show_stuff();

	//职工是否存在----------------------------------------------------------------------

	int IsExit(int id);

	//3删除职工----------------------------------------------------------------------
	void del_stuff();
	 

	//4修改职工----------------------------------------------------------------------

	void mod_stuff();

	//5查找职工----------------------------------------------------------------------

	void find_stuff();



	//6按照编号进行排序----------------------------------------------------------------------

	void sort_stuff();


	//7清空文件！cnmd----------------------------------------------------------------------
	void clean_stuff();



	//记录文件中的人数
	int member;

	//员工数组的指针！
	Worker** stuffArray;


	//文件是否为空的状态量
	bool fileisempty;

	

};



